init.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Basic Settings
These settings configure the startup behavior of Emacs, default modes, and auto-refresh options:
- Disable the splash screen to avoid distractions during startup.
- Set the default mode of the *scratch* buffer to Fundamental mode.
- Do not display system load averages in the mode line.
- Disable the creation of backup files to keep the filesystem clean.
- Enable auto-refresh of buffers when files change externally.
- Prevent constant polling for file changes and set a short interval for checking.
- Enable version control information checks during auto-refresh.

#+BEGIN_SRC elisp
    (setopt inhibit-splash-screen t)
    (setopt initial-major-mode 'fundamental-mode)
    (setopt display-time-default-load-average nil)
    (setq make-backup-files nil)
    (setq global-auto-revert-mode 1)
    (setopt auto-revert-avoid-polling t)
    (setopt auto-revert-interval 5)
    (setopt auto-revert-check-vc-info t)
    (delete-selection-mode 1)

    (global-display-line-numbers-mode)

    (add-hook 'org-timeblock-mode-hook (lambda () (display-line-numbers-mode 0)))
    (add-hook 'org-mode-hook (lambda () (display-line-numbers-mode 0)))
    (add-hook 'prog-mode-hook (lambda () (display-line-numbers-mode 1)))

    (recentf-mode 1)

    (add-to-list 'package-archives
                 '("melpa-stable" . "https://stable.melpa.org/packages/") t)
    (package-initialize)

  (use-package casual-suite :ensure t)
  (require 'casual-suite)
  (keymap-set calc-mode-map "C-o" #'casual-calc-tmenu)
  (keymap-set dired-mode-map "C-o" #'casual-dired-tmenu)
  (keymap-set isearch-mode-map "C-o" #'casual-isearch-tmenu)
  (keymap-set ibuffer-mode-map "C-o" #'casual-ibuffer-tmenu)
  (keymap-set ibuffer-mode-map "F" #'casual-ibuffer-filter-tmenu)
  (keymap-set ibuffer-mode-map "s" #'casual-ibuffer-sortby-tmenu)
  (keymap-set Info-mode-map "C-o" #'casual-info-tmenu)
  (keymap-set reb-mode-map "C-o" #'casual-re-builder-tmenu)
  (keymap-set reb-lisp-mode-map "C-o" #'casual-re-builder-tmenu)
  (keymap-set bookmark-bmenu-mode-map "C-o" #'casual-bookmarks-tmenu)
  (keymap-set org-agenda-mode-map "C-o" #'casual-agenda-tmenu)
  (keymap-global-set "M-g" #'casual-avy-tmenu)
  (keymap-set symbol-overlay-map "C-o" #'casual-symbol-overlay-tmenu)
  (keymap-global-set "C-o" #'casual-editkit-main-tmenu)
#+END_SRC

#+RESULTS:
: casual-editkit-main-tmenu

* Searching
Configuration for search-related tools and behaviors:
- Use ripgrep (rg) as the search backend for faster and more efficient searching.
- Customize the ripgrep command to display results in a compact format.

#+BEGIN_SRC elisp
(setq xref-search-program 'ripgrep)
(setq grep-command "rg -nS --noheading")
#+END_SRC
       
* Save History
Enable saving of minibuffer history across sessions for improved usability.

#+BEGIN_SRC elisp
(savehist-mode)
#+END_SRC

* Window Management
Configure shortcuts for easier navigation between windows:
- Use `Ctrl` and arrow keys to switch between Emacs windows.

#+BEGIN_SRC elisp
(windmove-default-keybindings 'control)
#+END_SRC

* Text Settings
Set text editing preferences:
- Configure sentences to end with a single space instead of a double space.

#+BEGIN_SRC emacs-lisp
(setopt sentence-end-double-space nil)
#+END_SRC

* Context Menu
Enable a graphical context menu for easier interaction:
- Display a context menu when right-clicking in graphical Emacs.

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (context-menu-mode))
#+END_SRC

* Backup Settings
Organize and manage backup files:
- Store all backup files in a dedicated directory within the Emacs configuration folder.
- Automatically create missing directories for backup files.

#+BEGIN_SRC emacs-lisp
(defun bedrock--backup-file-name (fpath)
  (let* ((backupRootDir (concat user-emacs-directory "emacs-backup/"))
         (filePath (replace-regexp-in-string "[A-Za-z]:" "" fpath))
         (backupFilePath (replace-regexp-in-string "//" "/" (concat backupRootDir filePath "~"))))
    (make-directory (file-name-directory backupFilePath) (file-name-directory backupFilePath))
    backupFilePath))
(setopt make-backup-file-name-function 'bedrock--backup-file-name)
#+END_SRC

* Discovery Aids
Enhance discoverability of keybindings and features:
- Show possible keybindings in a popup when typing incomplete key sequences.

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :config
  (which-key-mode))
#+END_SRC

