init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-26 Di 10:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="author" content="Tara Druffel" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b0beca">1. Basic Settings</a></li>
<li><a href="#org0843049">2. Searching</a></li>
<li><a href="#orgb6340c6">3. Save History</a></li>
<li><a href="#orgacbfd49">4. Window Management</a></li>
<li><a href="#orgd6cbbb9">5. Text Settings</a></li>
<li><a href="#org4a56edb">6. Context Menu</a></li>
<li><a href="#org7cdedf6">7. Backup Settings</a></li>
<li><a href="#org765c3d8">8. Discovery Aids</a></li>
<li><a href="#org81d2c9f">9. Minibuffer and Completion</a></li>
<li><a href="#org4443c50">10. Interface Enhancements</a></li>
<li><a href="#orgd4f218d">11. Tab Bar</a></li>
<li><a href="#org95acb72">12. Theme</a></li>
<li><a href="#org171dfa1">13. Language Configurations</a></li>
<li><a href="#orgd2953d5">14. Tools</a></li>
<li><a href="#orgec99380">15. Treesitter</a></li>
<li><a href="#orga4a218a">16. Package Setup</a></li>
<li><a href="#orgd8787e8">17. Indentation Settings</a></li>
<li><a href="#orge9e3a49">18. Keybinds</a>
<ul>
<li><a href="#org6326498">18.1. Which-Key Configuration</a></li>
<li><a href="#org4f766fb">18.2. File Keybindings</a></li>
<li><a href="#orgd3111b3">18.3. Level 1 Keybindings (Global)</a></li>
<li><a href="#org58ebc3a">18.4. Level 2 Keybindings (Grouped Actions)</a></li>
<li><a href="#orgb02d77e">18.5. GPT/AI Keybindings</a></li>
<li><a href="#orgf1189c1">18.6. Code-Related Keybindings</a></li>
<li><a href="#org5fc2fd0">18.7. Ledger Keybindings</a></li>
<li><a href="#orge008572">18.8. Disable Auto-Indent on ENTER</a></li>
<li><a href="#org986a9a9">18.9. Org-Mode and Notes Keybindings</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1b0beca" class="outline-2">
<h2 id="org1b0beca"><span class="section-number-2">1.</span> Basic Settings</h2>
<div class="outline-text-2" id="text-1">
<p>
These settings configure the startup behavior of Emacs, default modes, and auto-refresh options:
</p>
<ul class="org-ul">
<li>Disable the splash screen to avoid distractions during startup.</li>
<li>Set the default mode of the <b>scratch</b> buffer to Fundamental mode.</li>
<li>Do not display system load averages in the mode line.</li>
<li>Disable the creation of backup files to keep the filesystem clean.</li>
<li>Enable auto-refresh of buffers when files change externally.</li>
<li>Prevent constant polling for file changes and set a short interval for checking.</li>
<li>Enable version control information checks during auto-refresh.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #531ab6;">setopt</span> inhibit-splash-screen t)
(<span style="color: #531ab6;">setopt</span> initial-major-mode 'fundamental-mode)
(<span style="color: #531ab6;">setopt</span> display-time-default-load-average nil)
(<span style="color: #531ab6;">setq</span> make-backup-files nil)
(<span style="color: #531ab6;">setq</span> global-auto-revert-mode 1)
(<span style="color: #531ab6;">setopt</span> auto-revert-avoid-polling t)
(<span style="color: #531ab6;">setopt</span> auto-revert-interval 5)
(<span style="color: #531ab6;">setopt</span> auto-revert-check-vc-info t)
(delete-selection-mode 1)

(global-display-line-numbers-mode)

(add-hook 'org-timeblock-mode-hook (<span style="color: #531ab6;">lambda</span> () (display-line-numbers-mode 0)))
(add-hook 'org-mode-hook (<span style="color: #531ab6;">lambda</span> () (display-line-numbers-mode 0)))
(add-hook 'prog-mode-hook (<span style="color: #531ab6;">lambda</span> () (display-line-numbers-mode 1)))

(recentf-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0843049" class="outline-2">
<h2 id="org0843049"><span class="section-number-2">2.</span> Searching</h2>
<div class="outline-text-2" id="text-2">
<p>
Configuration for search-related tools and behaviors:
</p>
<ul class="org-ul">
<li>Use ripgrep (rg) as the search backend for faster and more efficient searching.</li>
<li>Customize the ripgrep command to display results in a compact format.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #531ab6;">setq</span> xref-search-program 'ripgrep)
(<span style="color: #531ab6;">setq</span> grep-command <span style="color: #3548cf;">"rg -nS --noheading"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6340c6" class="outline-2">
<h2 id="orgb6340c6"><span class="section-number-2">3.</span> Save History</h2>
<div class="outline-text-2" id="text-3">
<p>
Enable saving of minibuffer history across sessions for improved usability.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(savehist-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgacbfd49" class="outline-2">
<h2 id="orgacbfd49"><span class="section-number-2">4.</span> Window Management</h2>
<div class="outline-text-2" id="text-4">
<p>
Configure shortcuts for easier navigation between windows:
</p>
<ul class="org-ul">
<li>Use `Ctrl` and arrow keys to switch between Emacs windows.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(windmove-default-keybindings 'control)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6cbbb9" class="outline-2">
<h2 id="orgd6cbbb9"><span class="section-number-2">5.</span> Text Settings</h2>
<div class="outline-text-2" id="text-5">
<p>
Set text editing preferences:
</p>
<ul class="org-ul">
<li>Configure sentences to end with a single space instead of a double space.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setopt</span> sentence-end-double-space nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4a56edb" class="outline-2">
<h2 id="org4a56edb"><span class="section-number-2">6.</span> Context Menu</h2>
<div class="outline-text-2" id="text-6">
<p>
Enable a graphical context menu for easier interaction:
</p>
<ul class="org-ul">
<li>Display a context menu when right-clicking in graphical Emacs.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">when</span> (display-graphic-p)
  (context-menu-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7cdedf6" class="outline-2">
<h2 id="org7cdedf6"><span class="section-number-2">7.</span> Backup Settings</h2>
<div class="outline-text-2" id="text-7">
<p>
Organize and manage backup files:
</p>
<ul class="org-ul">
<li>Store all backup files in a dedicated directory within the Emacs configuration folder.</li>
<li>Automatically create missing directories for backup files.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">defun</span> <span style="color: #721045;">bedrock--backup-file-name</span> (fpath)
  (<span style="color: #531ab6;">let*</span> ((backupRootDir (concat user-emacs-directory <span style="color: #3548cf;">"emacs-backup/"</span>))
         (filePath (replace-regexp-in-string <span style="color: #3548cf;">"[A-Za-z]:"</span> <span style="color: #3548cf;">""</span> fpath))
         (backupFilePath (replace-regexp-in-string <span style="color: #3548cf;">"//"</span> <span style="color: #3548cf;">"/"</span> (concat backupRootDir filePath <span style="color: #3548cf;">"~"</span>))))
    (make-directory (file-name-directory backupFilePath) (file-name-directory backupFilePath))
    backupFilePath))
(<span style="color: #531ab6;">setopt</span> make-backup-file-name-function 'bedrock--backup-file-name)
</pre>
</div>
</div>
</div>
<div id="outline-container-org765c3d8" class="outline-2">
<h2 id="org765c3d8"><span class="section-number-2">8.</span> Discovery Aids</h2>
<div class="outline-text-2" id="text-8">
<p>
Enhance discoverability of keybindings and features:
</p>
<ul class="org-ul">
<li>Show possible keybindings in a popup when typing incomplete key sequences.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> which-key
  <span style="color: #8f0075;">:ensure</span> t
  <span style="color: #8f0075;">:config</span>
  (which-key-mode))
</pre>
</div>
</div>
</div>
