init.org
* Minibuffer and Completion
Improve the minibuffer completion experience:
- Allow nested minibuffer usage for recursive commands.
- Enable cycling through completion candidates with the TAB key.
- Display detailed annotations for completion candidates.
- Prioritize completion over indentation when pressing TAB.
- Group and organize completion suggestions for better readability.
- Automatically select a candidate after the second TAB press.

#+BEGIN_SRC emacs-lisp
(setopt enable-recursive-minibuffers t)
(setopt completion-cycle-threshold 1)
(setopt completions-detailed t)
(setopt tab-always-indent 'complete)
(setopt completion-styles '(basic initials substring))
(setopt completion-auto-help 'always)
(setopt completions-max-height 20)
(setopt completions-format 'one-column)
(setopt completions-group t)
(setopt completion-auto-select 'second-tab)
(ido-mode 1)
(fido-vertical-mode 1)
(keymap-set minibuffer-mode-map "TAB" 'minibuffer-complete)
#+END_SRC

* Interface Enhancements
Visual and interactive improvements:
- Show line and column numbers in the mode line.
- Enable relative line numbers globally for easier navigation.
- Improve underline appearance for better readability.
- Highlight current lines in text and programming modes.
- Enable smooth and precise scrolling with the mouse.

#+BEGIN_SRC emacs-lisp
(setopt line-number-mode t)
(setopt column-number-mode t)
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)
(setopt x-underline-at-descent-line nil)
(setopt switch-to-buffer-obey-display-actions t)
(setopt show-trailing-whitespace nil)
(setopt indicate-buffer-boundaries 'left)
(setopt mouse-wheel-tilt-scroll t)
(setopt mouse-wheel-flip-direction t)
(blink-cursor-mode -1)
(pixel-scroll-precision-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(setopt display-line-numbers-width 3)
(add-hook 'text-mode-hook 'visual-line-mode)
(let ((hl-line-hooks '(text-mode-hook prog-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))
#+END_SRC

* Tab Bar
Tab bar configurations:
- Show the tab bar when tab functions are invoked.
- Display the current date and time on the tab bar.

#+BEGIN_SRC emacs-lisp
(setopt tab-bar-show 1)
(add-to-list 'tab-bar-format 'tab-bar-format-align-right 'append)
(add-to-list 'tab-bar-format 'tab-bar-format-global 'append)
(setopt display-time-format "%a %F %T")
(setopt display-time-interval 1)
(display-time-mode)
#+END_SRC

* Theme

Configure and apply a theme:
- Load the `modus-operandi-tinted` theme.
- Apply the theme consistently when running as a daemon.

#+BEGIN_SRC emacs-lisp

    (use-package modus-themes
      :custom
      (modus-themes-italic-constructs t)
      (modus-themes-bold-constructs t)
      (modus-themes-mixed-fonts t)
      (modus-themes-headings '((1 . (1.5))
                               (2 . (1.3))
                               (t . (1.1))))
      (modus-themes-to-toggle
       '(modus-operandi-tinted modus-vivendi-tinted))
      :bind
      (("C-c w m" . modus-themes-toggle)
       ("C-c w M" . modus-themes-select)))

  (use-package ef-themes :ensure t)
  (setq custom-theme 'modus-operandi-tinted)

  (defun apply-modus-operandi-tinted-palette (frame)
    (with-selected-frame frame
      (load-theme custom-theme t)))
  (if (daemonp)
      (add-hook 'after-make-frame-functions #'apply-modus-operandi-tinted-palette)
    (load-theme custom-theme t))

  (defun set-default-font (frame)
    "Set the default font for the FRAME."
    (with-selected-frame frame
      (set-face-attribute 'default nil
                          :family "Monaspace Neon Var" ; Replace with your font name
                          :height 160
                          )))         ; Adjust the height as needed

  (if (daemonp)
      (add-hook 'after-make-frame-functions #'set-default-font)
    (set-default-font (selected-frame)))



    ;; Distraction-free writing
    (defun ews-distraction-free ()
      "Distraction-free writing environment using Olivetti package."
      (interactive)
      (if (equal olivetti-mode nil)
          (progn
            (window-configuration-to-register 1)
            (delete-other-windows)
            (text-scale-set 1)
            (olivetti-mode t))
        (progn
          (if (eq (length (window-list)) 1)
              (jump-to-register 1))
          (olivetti-mode 0)
          (text-scale-set 0))))

    (use-package olivetti
      :ensure t
      :demand t
      :bind
      (("<f9>" . ews-distraction-free)))
(setq olivetti-minium-Body-width 60)

(use-package spacious-padding :ensure t)
(require 'spacious-padding)

;; These are the default values, but I keep them here for visibility.
(setq spacious-padding-widths
      '( :internal-border-width 15
         :header-line-width 4
         :mode-line-width 6
         :tab-width 4
         :right-divider-width 30
         :scroll-bar-width 8
         :fringe-width 8))

(spacious-padding-mode 1)

;; Set a key binding if you need to toggle spacious padding.
(define-key global-map (kbd "<f8>") #'spacious-padding-mode)

#+END_SRC

#+RESULTS:
: spacious-padding-mode

* Language Configurations
Load language-specific configurations for various modes:
- Markdown
- Org
- Ledger
- Clojure 

#+BEGIN_SRC emacs-lisp
(load-file (expand-file-name "modules/lang/markdown.el" user-emacs-directory))
(load-file (expand-file-name "modules/lang/org.el" user-emacs-directory))
(load-file (expand-file-name "modules/lang/ledger.el" user-emacs-directory))
(load-file (expand-file-name "modules/lang/clojure.el" user-emacs-directory))
#+END_SRC

