init.html
<div id="outline-container-org81d2c9f" class="outline-2">
<h2 id="org81d2c9f"><span class="section-number-2">9.</span> Minibuffer and Completion</h2>
<div class="outline-text-2" id="text-9">
<p>
Improve the minibuffer completion experience:
</p>
<ul class="org-ul">
<li>Allow nested minibuffer usage for recursive commands.</li>
<li>Enable cycling through completion candidates with the TAB key.</li>
<li>Display detailed annotations for completion candidates.</li>
<li>Prioritize completion over indentation when pressing TAB.</li>
<li>Group and organize completion suggestions for better readability.</li>
<li>Automatically select a candidate after the second TAB press.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setopt</span> enable-recursive-minibuffers t)
(<span style="color: #531ab6;">setopt</span> completion-cycle-threshold 1)
(<span style="color: #531ab6;">setopt</span> completions-detailed t)
(<span style="color: #531ab6;">setopt</span> tab-always-indent 'complete)
(<span style="color: #531ab6;">setopt</span> completion-styles '(basic initials substring))
(<span style="color: #531ab6;">setopt</span> completion-auto-help 'always)
(<span style="color: #531ab6;">setopt</span> completions-max-height 20)
(<span style="color: #531ab6;">setopt</span> completions-format 'one-column)
(<span style="color: #531ab6;">setopt</span> completions-group t)
(<span style="color: #531ab6;">setopt</span> completion-auto-select 'second-tab)
(keymap-set minibuffer-mode-map <span style="color: #3548cf;">"TAB"</span> 'minibuffer-complete)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4443c50" class="outline-2">
<h2 id="org4443c50"><span class="section-number-2">10.</span> Interface Enhancements</h2>
<div class="outline-text-2" id="text-10">
<p>
Visual and interactive improvements:
</p>
<ul class="org-ul">
<li>Show line and column numbers in the mode line.</li>
<li>Enable relative line numbers globally for easier navigation.</li>
<li>Improve underline appearance for better readability.</li>
<li>Highlight current lines in text and programming modes.</li>
<li>Enable smooth and precise scrolling with the mouse.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setopt</span> line-number-mode t)
(<span style="color: #531ab6;">setopt</span> column-number-mode t)
(global-display-line-numbers-mode)
(<span style="color: #531ab6;">setq</span> display-line-numbers-type 'relative)
(<span style="color: #531ab6;">setopt</span> x-underline-at-descent-line nil)
(<span style="color: #531ab6;">setopt</span> switch-to-buffer-obey-display-actions t)
(<span style="color: #531ab6;">setopt</span> show-trailing-whitespace nil)
(<span style="color: #531ab6;">setopt</span> indicate-buffer-boundaries 'left)
(<span style="color: #531ab6;">setopt</span> mouse-wheel-tilt-scroll t)
(<span style="color: #531ab6;">setopt</span> mouse-wheel-flip-direction t)
(blink-cursor-mode -1)
(pixel-scroll-precision-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(<span style="color: #531ab6;">setopt</span> display-line-numbers-width 3)
(add-hook 'text-mode-hook 'visual-line-mode)
(<span style="color: #531ab6;">let</span> ((hl-line-hooks '(text-mode-hook prog-mode-hook)))
  (mapc (<span style="color: #531ab6;">lambda</span> (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4f218d" class="outline-2">
<h2 id="orgd4f218d"><span class="section-number-2">11.</span> Tab Bar</h2>
<div class="outline-text-2" id="text-11">
<p>
Tab bar configurations:
</p>
<ul class="org-ul">
<li>Show the tab bar when tab functions are invoked.</li>
<li>Display the current date and time on the tab bar.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setopt</span> tab-bar-show 1)
(add-to-list 'tab-bar-format 'tab-bar-format-align-right 'append)
(add-to-list 'tab-bar-format 'tab-bar-format-global 'append)
(<span style="color: #531ab6;">setopt</span> display-time-format <span style="color: #3548cf;">"%a %F %T"</span>)
(<span style="color: #531ab6;">setopt</span> display-time-interval 1)
(display-time-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org95acb72" class="outline-2">
<h2 id="org95acb72"><span class="section-number-2">12.</span> Theme</h2>
<div class="outline-text-2" id="text-12">
<p>
Configure and apply a theme:
</p>
<ul class="org-ul">
<li>Load the `modus-operandi-tinted` theme.</li>
<li>Apply the theme consistently when running as a daemon.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">defun</span> <span style="color: #721045;">apply-modus-operandi-tinted-palette</span> (frame)
  (<span style="color: #531ab6;">with-selected-frame</span> frame
    (load-theme 'modus-operandi-tinted t)))
(<span style="color: #531ab6;">if</span> (daemonp)
    (add-hook 'after-make-frame-functions #'apply-modus-operandi-tinted-palette)
  (load-theme 'modus-operandi-tinted t))

(<span style="color: #531ab6;">defun</span> <span style="color: #721045;">set-default-font</span> (frame)
  <span style="color: #2a5045;">"Set the default font for the FRAME."</span>
  (<span style="color: #531ab6;">with-selected-frame</span> frame
    (set-face-attribute 'default nil
                        <span style="color: #8f0075;">:family</span> <span style="color: #3548cf;">"Monaspace Neon Var"</span> <span style="color: #7f0000;">; </span><span style="color: #7f0000;">Replace with your font name</span>
                        <span style="color: #8f0075;">:height</span> 160
                        )))         <span style="color: #7f0000;">; </span><span style="color: #7f0000;">Adjust the height as needed</span>

(<span style="color: #531ab6;">if</span> (daemonp)
    (add-hook 'after-make-frame-functions #'set-default-font)
  (set-default-font (selected-frame)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org171dfa1" class="outline-2">
<h2 id="org171dfa1"><span class="section-number-2">13.</span> Language Configurations</h2>
<div class="outline-text-2" id="text-13">
<p>
Load language-specific configurations for various modes:
</p>
<ul class="org-ul">
<li>Markdown</li>
<li>Org</li>
<li>Ledger</li>
<li>Clojure</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-file (expand-file-name <span style="color: #3548cf;">"modules/lang/markdown.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/lang/org.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/lang/ledger.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/lang/clojure.el"</span> user-emacs-directory))
</pre>
</div>
</div>
</div>
