init.html
<div id="outline-container-orgd2953d5" class="outline-2">
<h2 id="orgd2953d5"><span class="section-number-2">14.</span> Tools</h2>
<div class="outline-text-2" id="text-14">
<p>
Load additional tools for productivity:
</p>
<ul class="org-ul">
<li>Include tools for LSP (Eglot), documentation, terminal, GPT, and RSS feeds.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/eglot.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/devdocs.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/term.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/work/work.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/gptel.el"</span> user-emacs-directory))
(load-file (expand-file-name <span style="color: #3548cf;">"modules/tools/rss.el"</span> user-emacs-directory))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec99380" class="outline-2">
<h2 id="orgec99380"><span class="section-number-2">15.</span> Treesitter</h2>
<div class="outline-text-2" id="text-15">
<p>
Enable Treesitter for improved syntax highlighting and parsing:
</p>
<ul class="org-ul">
<li>Map language modes to their Treesitter equivalents.</li>
<li>Configure Treesitter grammars for supported languages.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> emacs
  <span style="color: #8f0075;">:config</span>
  (<span style="color: #531ab6;">setq</span> major-mode-remap-alist
        '((yaml-mode . yaml-ts-mode)
          (bash-mode . bash-ts-mode)
          (js2-mode . js-ts-mode)
          (html-mode . html-ts-mode)
          (mhtml-mode . html-ts-mode)
          (typescript-mode . typescript-ts-mode)
          (json-mode . json-ts-mode)
          (css-mode . css-ts-mode)
          (python-mode . python-ts-mode)))
  <span style="color: #8f0075;">:hook</span>
  ((prog-mode . electric-pair-mode)))

(<span style="color: #531ab6;">setq</span> treesit-language-source-alist
      '((bash <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-bash"</span>)
        (cmake <span style="color: #3548cf;">"https://github.com/uyha/tree-sitter-cmake"</span>)
        (css <span style="color: #3548cf;">"https://github.com/tree-sitter-tree-sitter-css"</span>)
        (elisp <span style="color: #3548cf;">"https://github.com/Wilfred/tree-sitter-elisp"</span>)
        (go <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-go"</span>)
        (html <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-html"</span>)
        (javascript <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-javascript"</span> <span style="color: #3548cf;">"master"</span> <span style="color: #3548cf;">"src"</span>)
        (json <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-json"</span>)
        (make <span style="color: #3548cf;">"https://github.com/alemuller/tree-sitter-make"</span>)
        (markdown <span style="color: #3548cf;">"https://github.com/ikatyang/tree-sitter-markdown"</span>)
        (python <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-python"</span>)
        (tsx <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-typescript"</span> <span style="color: #3548cf;">"master"</span> <span style="color: #3548cf;">"tsx/src"</span>)
        (typescript <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-typescript"</span> <span style="color: #3548cf;">"master"</span> <span style="color: #3548cf;">"typescript/src"</span>)
        (yaml <span style="color: #3548cf;">"https://github.com/ikatyang/tree-sitter-yaml"</span>)
        (java <span style="color: #3548cf;">"https://github.com/tree-sitter/tree-sitter-java"</span> <span style="color: #3548cf;">"master"</span> <span style="color: #3548cf;">"src"</span>)
        (clojure <span style="color: #3548cf;">"https://github.com/sogaiu/tree-sitter-clojure"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga4a218a" class="outline-2">
<h2 id="orga4a218a"><span class="section-number-2">16.</span> Package Setup</h2>
<div class="outline-text-2" id="text-16">
<p>
This section sets up key packages like `expand-region` and `exec-path-from-shell`.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">use-package</span> expand-region
  <span style="color: #8f0075;">:ensure</span> t)
(<span style="color: #531ab6;">require</span> '<span style="color: #0000b0;">expand-region</span>)

(<span style="color: #531ab6;">use-package</span> exec-path-from-shell <span style="color: #8f0075;">:ensure</span> t)
(<span style="color: #531ab6;">when</span> (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8787e8" class="outline-2">
<h2 id="orgd8787e8"><span class="section-number-2">17.</span> Indentation Settings</h2>
<div class="outline-text-2" id="text-17">
<p>
Set global indentation preferences.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setq-default</span> indent-tabs-mode nil)
(<span style="color: #531ab6;">setq-default</span> tab-width 4)
(<span style="color: #531ab6;">setq</span> indent-line-function 'insert-tab)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9e3a49" class="outline-2">
<h2 id="orge9e3a49"><span class="section-number-2">18.</span> Keybinds</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org6326498" class="outline-3">
<h3 id="org6326498"><span class="section-number-3">18.1.</span> Which-Key Configuration</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Configure `which-key` for improved keybinding discovery.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">setq</span> which-key-sort-order 'which-key-key-order-alpha)
(<span style="color: #531ab6;">setq</span> which-key-max-display-columns 2)
(<span style="color: #531ab6;">setq</span> which-key-popup-type 'side-window)
(<span style="color: #531ab6;">setq</span> which-key-side-window-location 'right)
(<span style="color: #531ab6;">setq</span> which-key-side-window-max-height 0.25)
(<span style="color: #531ab6;">setq</span> which-key-side-window-max-width 0.33)

(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-x 3"</span> <span style="color: #3548cf;">"Open Split"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-x C-f"</span> <span style="color: #3548cf;">"[F]ile"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f766fb" class="outline-3">
<h3 id="org4f766fb"><span class="section-number-3">18.2.</span> File Keybindings</h3>
<div class="outline-text-3" id="text-18-2">
<p>
Define keybindings for file-related operations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-prefix-command 'file-prefix-map)
(global-set-key (kbd <span style="color: #3548cf;">"C-x C-f"</span>) 'file-prefix-map)
(define-key file-prefix-map (kbd <span style="color: #3548cf;">"f"</span>) 'find-file)           <span style="color: #7f0000;">; </span><span style="color: #7f0000;">Open file</span>
(define-key file-prefix-map (kbd <span style="color: #3548cf;">"r"</span>) 'recentf)            <span style="color: #7f0000;">; </span><span style="color: #7f0000;">Open recent files</span>
</pre>
</div>
</div>
</div>
