init.org
** Level 1 Keybindings (Global)
Keybindings for general operations like selection expansion, scrolling, and searching.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-=") (cons "Expand Selection" 'er/expand-region))
(global-set-key (kbd "s-v") 'cua-paste)
(global-set-key (kbd "C-v") 'scroll-up-command)
(global-set-key (kbd "M-s g") 'grep-find)
#+END_SRC

** Level 2 Keybindings (Grouped Actions)
Group related keybindings under prefixes like `C-c o` (open), `C-c c` (code), and more.

#+BEGIN_SRC emacs-lisp
(which-key-add-key-based-replacements "C-c o" "[O]pen")
(which-key-add-key-based-replacements "C-c c" "[C]ode")
(which-key-add-key-based-replacements "C-c j" "[J]ump to")
(which-key-add-key-based-replacements "C-c l" "[L]edger")
(which-key-add-key-based-replacements "C-c n" "[N]otes")
(which-key-add-key-based-replacements "C-c x" "[X] Capture")
#+END_SRC

** GPT/AI Keybindings
Keybindings for GPT-related operations.

#+BEGIN_SRC emacs-lisp
(define-prefix-command 'gptel-prefix-map)
(global-set-key (kbd "C-c oc") 'gptel-prefix-map)
(which-key-add-key-based-replacements "C-c oc" "AI [C]hat")
(define-key gptel-prefix-map (kbd "m") (cons "Open AI [M]enu" 'gptel-menu))
(define-key gptel-prefix-map (kbd "s") (cons "[S]end to AI" 'gptel-send))
(define-key gptel-prefix-map (kbd "C") (cons "AI [C]hat" 'gptel))
#+END_SRC

** Code-Related Keybindings
Keybindings for programming and code-related actions.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c cf") 'eglot-format)
(global-set-key (kbd "C-c cc") 'compile)
(global-set-key (kbd "C-c ca") 'eglot-code-actions)
(global-set-key (kbd "M-[") 'flymake-goto-prev-error)
(global-set-key (kbd "M-]") 'flymake-goto-next-error)
#+END_SRC

** Ledger Keybindings
Keybindings for Hledger-related operations.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c lr") 'hledger-run-command)
(global-set-key (kbd "C-c le") 'hledger-jentry)
#+END_SRC

** Disable Auto-Indent on ENTER
Disable automatic indentation when pressing ENTER.

#+BEGIN_SRC emacs-lisp
(when (fboundp 'electric-indent-mode) (electric-indent-mode -1))
#+END_SRC

** Org-Mode and Notes Keybindings
Keybindings for Org-mode and notes management.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c ns") 'org-search-view)
(global-set-key (kbd "C-c ncd") 'org-timeblock)
(global-set-key (kbd "C-c ncm") 'cfw:open-org-calendar)
(global-set-key (kbd "C-c na") 'org-agenda)
(global-set-key (kbd "C-c x") 'org-capture)
#+END_SRC
* others
#+begin_src elisp
(setq org-safe-remote-resources
   '("\\`https://fniessen\\.github\\.io/org-html-themes/org/theme-readtheorg\\.setup\\'"))
#+end_src

#+RESULTS:
| \`https://fniessen\.github\.io/org-html-themes/org/theme-readtheorg\.setup\' |
