init.html
<div id="outline-container-orgd3111b3" class="outline-3">
<h3 id="orgd3111b3"><span class="section-number-3">18.3.</span> Level 1 Keybindings (Global)</h3>
<div class="outline-text-3" id="text-18-3">
<p>
Keybindings for general operations like selection expansion, scrolling, and searching.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #3548cf;">"C-="</span>) (cons <span style="color: #3548cf;">"Expand Selection"</span> 'er/expand-region))
(global-set-key (kbd <span style="color: #3548cf;">"s-v"</span>) 'cua-paste)
(global-set-key (kbd <span style="color: #3548cf;">"C-v"</span>) 'scroll-up-command)
(global-set-key (kbd <span style="color: #3548cf;">"M-s g"</span>) 'grep-find)
</pre>
</div>
</div>
</div>
<div id="outline-container-org58ebc3a" class="outline-3">
<h3 id="org58ebc3a"><span class="section-number-3">18.4.</span> Level 2 Keybindings (Grouped Actions)</h3>
<div class="outline-text-3" id="text-18-4">
<p>
Group related keybindings under prefixes like `C-c o` (open), `C-c c` (code), and more.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c o"</span> <span style="color: #3548cf;">"[O]pen"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c c"</span> <span style="color: #3548cf;">"[C]ode"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c j"</span> <span style="color: #3548cf;">"[J]ump to"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c l"</span> <span style="color: #3548cf;">"[L]edger"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c n"</span> <span style="color: #3548cf;">"[N]otes"</span>)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c x"</span> <span style="color: #3548cf;">"[X] Capture"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb02d77e" class="outline-3">
<h3 id="orgb02d77e"><span class="section-number-3">18.5.</span> GPT/AI Keybindings</h3>
<div class="outline-text-3" id="text-18-5">
<p>
Keybindings for GPT-related operations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-prefix-command 'gptel-prefix-map)
(global-set-key (kbd <span style="color: #3548cf;">"C-c oc"</span>) 'gptel-prefix-map)
(which-key-add-key-based-replacements <span style="color: #3548cf;">"C-c oc"</span> <span style="color: #3548cf;">"AI [C]hat"</span>)
(define-key gptel-prefix-map (kbd <span style="color: #3548cf;">"m"</span>) (cons <span style="color: #3548cf;">"Open AI [M]enu"</span> 'gptel-menu))
(define-key gptel-prefix-map (kbd <span style="color: #3548cf;">"s"</span>) (cons <span style="color: #3548cf;">"[S]end to AI"</span> 'gptel-send))
(define-key gptel-prefix-map (kbd <span style="color: #3548cf;">"C"</span>) (cons <span style="color: #3548cf;">"AI [C]hat"</span> 'gptel))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf1189c1" class="outline-3">
<h3 id="orgf1189c1"><span class="section-number-3">18.6.</span> Code-Related Keybindings</h3>
<div class="outline-text-3" id="text-18-6">
<p>
Keybindings for programming and code-related actions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #3548cf;">"C-c cf"</span>) 'eglot-format)
(global-set-key (kbd <span style="color: #3548cf;">"C-c cc"</span>) 'compile)
(global-set-key (kbd <span style="color: #3548cf;">"C-c ca"</span>) 'eglot-code-actions)
(global-set-key (kbd <span style="color: #3548cf;">"M-["</span>) 'flymake-goto-prev-error)
(global-set-key (kbd <span style="color: #3548cf;">"M-]"</span>) 'flymake-goto-next-error)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5fc2fd0" class="outline-3">
<h3 id="org5fc2fd0"><span class="section-number-3">18.7.</span> Ledger Keybindings</h3>
<div class="outline-text-3" id="text-18-7">
<p>
Keybindings for Hledger-related operations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #3548cf;">"C-c lr"</span>) 'hledger-run-command)
(global-set-key (kbd <span style="color: #3548cf;">"C-c le"</span>) 'hledger-jentry)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge008572" class="outline-3">
<h3 id="orge008572"><span class="section-number-3">18.8.</span> Disable Auto-Indent on ENTER</h3>
<div class="outline-text-3" id="text-18-8">
<p>
Disable automatic indentation when pressing ENTER.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #531ab6;">when</span> (fboundp 'electric-indent-mode) (electric-indent-mode -1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org986a9a9" class="outline-3">
<h3 id="org986a9a9"><span class="section-number-3">18.9.</span> Org-Mode and Notes Keybindings</h3>
<div class="outline-text-3" id="text-18-9">
<p>
Keybindings for Org-mode and notes management.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #3548cf;">"C-c ns"</span>) 'org-search-view)
(global-set-key (kbd <span style="color: #3548cf;">"C-c ncd"</span>) 'org-timeblock)
(global-set-key (kbd <span style="color: #3548cf;">"C-c ncm"</span>) 'cfw:open-org-calendar)
(global-set-key (kbd <span style="color: #3548cf;">"C-c na"</span>) 'org-agenda)
(global-set-key (kbd <span style="color: #3548cf;">"C-c x"</span>) 'org-capture)
(global-set-key (kbd <span style="color: #3548cf;">"C-c nf"</span>) 'ido-find-file-in-dir)
(global-set-key (kbd <span style="color: #3548cf;">"C-c n f"</span>) (<span style="color: #531ab6;">lambda</span> () (<span style="color: #531ab6;">interactive</span>) (find-file <span style="color: #3548cf;">"~/org"</span>)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tara Druffel</p>
<p class="date">Created: 2024-11-26 Di 10:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
